tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "oven-sh/bun"

brew "openssl@3"
brew "bat"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "gh"
brew "git"
brew "neovim"
brew "openjdk"
brew "pnpm"
brew "powerlevel10k"
brew "ripgrep"
brew "rustup"
brew "zsh"
brew "oven-sh/bun/bun"

cask "1password"
cask "adobe-creative-cloud"
cask "arc"
cask "betterdisplay"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "feishu"
cask "figma"
cask "firefox@developer-edition"
cask "ghostty"
cask "hiddenbar"
cask "iina"
cask "input-source-pro"
cask "karabiner-elements"
cask "keka"
cask "mos"
cask "neteasemusic"
cask "obs"
cask "ogdesign-eagle"
cask "orbstack"
cask "qq"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "telegram"
cask "tencent-meeting"
cask "wechat"
cask "wpsoffice-cn"
cask "xcodes"
