tap "homebrew/bundle"
tap "oven-sh/bun"

brew "bat"
brew "fd"
brew "fish"
brew "fnm"
brew "gh"
brew "git"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "yarn"
brew "oven-sh/bun/bun"

cask "1password"
cask "arc"
cask "discord"
cask "feishu"
cask "figma"
cask "firefox@developer-edition"
cask "gitkraken"
cask "input-source-pro"
cask "keka"
cask "kitty"
cask "mos"
cask "orbstack"
cask "qq"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "tencent-meeting"
cask "tiles"
cask "wechat"
cask "wpsoffice-cn"
cask "zed"
